heliumPlume/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-0.165 0.0 -0.165) //0
    (-0.165 0.0 0.165) //1
    ( 0.165 0.0 0.165) //2
    ( 0.165 0.0 -0.165) //3

    (-0.353553 0.0 -0.353553) //4
    (-0.353553 0.0 0.353553) //5
    ( 0.353553 0.0 0.353553) //6
    ( 0.353553 0.0 -0.353553) //7

    (-0.707106 0.0 -0.707106) //8
    (-0.707106 0.0 0.707106) //9
    ( 0.707106 0.0 0.707106) //10
    ( 0.707106 0.0 -0.707106) //11

    (-1.414213 0.0 -1.414213) //12
    (-1.414213 0.0 1.414213) //13
    ( 1.414213 0.0 1.414213) //14
    ( 1.414213 0.0 -1.414213) //15

    (-0.165 4.0 -0.165) //16
    (-0.165 4.0 0.165) //17
    ( 0.165 4.0 0.165) //18
    ( 0.165 4.0 -0.165) //19

    (-0.353553 4.0 -0.353553) //20
    (-0.353553 4.0 0.353553) //21
    ( 0.353553 4.0 0.353553) //22
    ( 0.353553 4.0 -0.353553) //23

    (-0.707106 4.0 -0.707106) //24
    (-0.707106 4.0 0.707106) //25
    ( 0.707106 4.0 0.707106) //26
    ( 0.707106 4.0 -0.707106) //27

    (-1.414213 4.0 -1.414213) //28
    (-1.414213 4.0 1.414213) //29
    ( 1.414213 4.0 1.414213) //30
    ( 1.414213 4.0 -1.414213) //31

 
 );

blocks          
(
    hex (0 3 19 16 1 2 18 17) (6 66 6) simpleGrading (1 1 1) //square top-inlet

    hex (4 0 16 20 5 1 17 21) (6 66 6) simpleGrading (1 1 1) // W top-inlet inner
    hex (1 2 18 17 5 6 22 21) (6 66 6) simpleGrading (1 1 1) // S top-inlet inner
    hex (3 7 23 19 2 6 22 18) (6 66 6) simpleGrading (1 1 1) // E top-inlet inner
    hex (4 7 23 20 0 3 19 16) (6 66 6) simpleGrading (1 1 1) // N top-inlet inner

    hex (8 4 20 24 9 5 21 25) (8 66 6) simpleGrading (1 1 1) // W top-inlet outer
    hex (5 6 22 21 9 10 26 25) (6 66 8) simpleGrading (1 1 1) // S top-inlet outer
    hex (7 11 27 23 6 10 26 22) (8 66 6) simpleGrading (1 1 1) // E top-inlet outer
    hex (8 11 27 24 4 7 23 20) (6 66 8) simpleGrading (1 1 1) // N top-inlet outer

    hex (12 8 24 28 13 9 25 29) (18 66 6) simpleGrading (1 1 1) // W inlet-coflow
    hex (9 10 26 25 13 14 30 29) (6 66 18) simpleGrading (1 1 1) // S inlet-coflow
    hex (11 15 31 27 10 14 30 26) (18 66 6) simpleGrading (1 1 1) // E inlet-coflow
    hex (12 15 31 28 8 11 27 24) (6 66 18) simpleGrading (1 1 1) // N inlet-coflow

);

edges           
(

arc 4 5 (-0.5 0 0)
arc 5 6 (0 0 0.5)
arc 6 7 (0.5 0 0)
arc 7 4 (0 0 -0.5)

arc 8 9 (-1.0 0 0)
arc 9 10 (0 0 1.0)
arc 10 11 (1.0 0 0)
arc 11 8 (0 0 -1.0)

arc 12 13 (-2.0 0 0)
arc 13 14 (0 0 2.0)
arc 14 15 (2.0 0 0)
arc 15 12 (0 0 -2.0)

arc 20 21 (-0.5 4.0 0)
arc 21 22 (0 4.0 0.5)
arc 22 23 (0.5 4.0 0)
arc 23 20 (0 4.0 -0.5)

arc 24 25 (-1.0 4.0 0)
arc 25 26 (0 4.0 1.0)
arc 26 27 (1.0 4.0 0)
arc 27 24 (0 4.0 -1.0)

arc 28 29 (-2.0 4.0 0)
arc 29 30 (0 4.0 2.0)
arc 30 31 (2.0 4.0 0)
arc 31 28 (0 4.0 -2.0)

);

patches         
(

    patch inlet
    (
      (0 1 2 3)
      (4 5 1 0)
      (5 6 2 1)
      (2 6 7 3)
      (0 3 7 4)
    )

    wall plate 
    (
      (8 9 5 4)
      (9 10 6 5)
      (6 10 11 7)
      (4 7 11 8)
    )

    patch coflow
    (
      (12 13 9 8)
      (9 13 14 10)
      (10 14 15 11)
      (8 11 15 12)
    )

    patch sides 
    (
      (12 13 29 28)
      (13 14 30 29)
      (14 15 31 30)
      (15 12 28 31)    
    )

    patch outlet
    (
      (16 17 18 19)

      (20 21 17 16)
      (21 22 18 17)
      (22 23 19 18)
      (16 19 23 20)

      (24 25 21 20)
      (21 25 26 22)
      (22 26 27 23)
      (20 23 27 24)

      (28 29 25 24)
      (29 30 26 25)
      (30 31 27 26)
      (24 27 31 28)
    )

);

mergePatchPairs
(  
    
);

// ************************************************************************* //
